
#include "Func_for_Info_KL_AI_Adr.h"
#include "Func_for_Info_KL_AI_Adr_Public.h"

        



/*****************************************************************************/
//вернуть средний токов ответа 
/*****************************************************************************/
uint8_t Get_CurrentMediumAnswer_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.CurrentMediumAnswer;
}
/** end **/
/*****************************************************************************/
//установить средний токов ответа 
/*****************************************************************************/
void Set_CurrentMediumAnswer_Info_Adr_KLAI ( const uint8_t CurrentMediumAnswer )
{    
  InfoStructKLAIAdr.CurrentMediumAnswer = CurrentMediumAnswer;
}
/** end **/
/*****************************************************************************/
//вернуть  токи первого стартового бита 
/*****************************************************************************/
uint8_t Get_CurrentTableFirstBit_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.CurrentTableFirstBit;
}
/** end **/
/*****************************************************************************/
//установить токи первого стартового бита 
/*****************************************************************************/
void Set_CurrentTableFirstBit_Info_Adr_KLAI ( const uint8_t CurrentTableFirstBit )
{    
  InfoStructKLAIAdr.CurrentTableFirstBit = CurrentTableFirstBit;
}
/** end **/
/*****************************************************************************/
//вернуть состояние ключей
/*****************************************************************************/
uint8_t Get_CondOuts_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.CondOuts;
}
/** end **/
/*****************************************************************************/
//установить состояние ключей
/*****************************************************************************/
void Set_CondOuts_Info_Adr_KLAI ( const uint8_t CondOuts )
{    
  InfoStructKLAIAdr.CondOuts = CondOuts;
}
/** end **/
/*****************************************************************************/
//вернуть вскрыт ли адрес
/*****************************************************************************/
uint8_t Get_OpenLabel_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.OpenLabel;
}
/** end **/
/*****************************************************************************/
//установить вскрыт ли адрес
/*****************************************************************************/
void Set_OpenLabel_Info_Adr_KLAI ( const uint8_t OpenLabel )
{    
  InfoStructKLAIAdr.OpenLabel = OpenLabel;
}
/** end **/
/*****************************************************************************/
//вернуть В пожаре ли адрес
/*****************************************************************************/
uint8_t Get_FireLabel_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.FireLabel;
}
/** end **/
/*****************************************************************************/
//установить В пожаре ли адрес
/*****************************************************************************/
void Set_FireLabel_Info_Adr_KLAI ( const uint8_t FireLabel )
{    
  InfoStructKLAIAdr.FireLabel = FireLabel;
}
/** end **/
/*****************************************************************************/
//вернуть  версию МА
/*****************************************************************************/
uint8_t Get_AnalogVal_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.AnalogVal ;
}
/** end **/
/*****************************************************************************/
//установить версию МА
/*****************************************************************************/
void Set_AnalogVal_Info_Adr_KLAI ( const uint8_t AnalogVal )
{    
  InfoStructKLAIAdr.AnalogVal = AnalogVal;
}
/** end **/ 
/*****************************************************************************/
//вернуть  версию МА
/*****************************************************************************/
uint8_t Get_Ver_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.Ver ;
}
/** end **/
/*****************************************************************************/
//установить версию МА
/*****************************************************************************/
void Set_Ver_Info_Adr_KLAI ( const uint8_t Ver )
{    
  InfoStructKLAIAdr.Ver = Ver;
}
/** end **/  
/*****************************************************************************/
//вернуть тип МА
/*****************************************************************************/
uint8_t Get_Type_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.Type ;
}
/** end **/
/*****************************************************************************/
//установить тип МА
/*****************************************************************************/
void Set_Type_Info_Adr_KLAI ( const uint8_t Type )
{    
  InfoStructKLAIAdr.Type = Type;
}
/** end **/  
/*****************************************************************************/
//вернуть полный адрес устройства
/*****************************************************************************/
AdrDevice_t Get_FullAdressDev_Info_Adr_KLAI ( void )
{    
  return  InfoStructKLAIAdr.AdrDevice ;
}
/** end **/
/*****************************************************************************/
//установить полный адрес устройства
/*****************************************************************************/
void Set_FullAdressDev_Info_Adr_KLAI ( AdrDevice_t AdrDevice )
{    
  InfoStructKLAIAdr.AdrDevice = AdrDevice;
}
/** end **/  


